; 57 - 汇编编译器(masm.exe)JMP指令的相关处理及问题【I 向前转移】
; =================================================================
; 如果disp在区间[-128, 127]
; =================================================================

assume cs:codesg

codesg segment
	s:	jmp s
		jmp short s
		jmp near ptr s
		jmp far ptr s
codesg ends

end s


; =================================================================
; 如果disp在区间[-128, 127]，不管汇编指令是以上格式中的哪一种  <-- 注意是 [-128, +127]，不是 [-127, 127]
; 都将它转变为jmp short s 所对应的的机器码
; jmp short s --> 对应的机器码格式为：EB?? 占用两个字节
; =================================================================
