; 103 - 利用子程序思想完成对字符串大小转换
; =================================================================
; 
; =================================================================
; 编程：将data段中的字符串转换为大写
; =================================================================

assume cs:codesg, ds:datasg

; =================================================================

datasg segment
		db 'conversation'
datasg ends

; =================================================================


codesg segment
start:			mov ax, datasg
			mov ds, ax
			mov di, 0
			mov cx, 12
			call capital
			
			mov ax, 4c00h
			int 21h


	; --------------------------- 子程序 ---------------------------
	; 说明：将字符串转换为大写
	; 参数：字符串首地址：ds:[di], (di) = 0
	; 结果：直接更改对应内存单元内容
	capital:	and byte ptr ds:[di], 11011111B
			inc di
			loop capital
			ret

codesg ends
end start

; =================================================================;



