; 185 - 在屏幕的dh行、dl列显示cx个bl属性的'al'【中断例程】
; =================================================================

; 185 - 在屏幕的5行、12列显示3个红底闪烁高亮绿色的'a'
; 程序说明请详见 P260
; 

; =================================================================
assume cs:code, ss:stack
; =================================================================

; =================================================================
stack segment stack
		db	128 dup (0)
stack ends
; =================================================================
code segment
start:		mov ax, stack
		mov ss, ax
		mov sp, 128

		mov ah, 2	; 调用第 2 个子例程 - 定位光标
		mov bh, 0	; 第 0 页
		mov dh, 5	; 行
		mov dl, 12	; 列
		int 10h


		mov ah, 9	; 调用第 9 个子例程 - 在光标位置显示字符
		mov al, 'a'	; 显示的字符
		mov bl, 01001010B; 字符的属性
		mov bh, 0	; 第 0 
		mov cx, 3	; 重复几次
		int 10h


		mov ax, 4c00h
		int 21h

code ends

end start
