; 51 - offset操作符
; =================================================================
; 
; OFFECT --> 伪指令 --> 由编译器处理
; 
; 功能：取得标号的 “偏移地址”
; 
; =================================================================
; 如有以下代码段，填写两条指令，使该程序在运行中将s处的一条指令复制到s0中

; P176 问题9.1
; =================================================================

assume cs:codesg

; ----------------------------------------------------------------

codesg segment
	s:	mov ax, bx
		mov si, offset s
		mov di, offset s0
		
		mov ax, cs:[si]		;___________

		mov cs:[di], ax		;___________

	s0:	nop		;nop机器码占用一个字节
		nop

codesg ends

end s

