; 59 - 汇编编译器(masm.exe)JMP指令的相关处理及问题【III 向后转移】
; =================================================================
; 如果disp在区间[-128, 127]
; =================================================================

assume cs:codesg

codesg segment
begin:		jmp short s
		jmp s
		jmp near ptr s
		jmp far ptr s
	s:	mov ax, 0
codesg ends

end begin


; =================================================================
; 在Debug中执行并查看数据，详尽解释请见P332 附录3
; =================================================================
; 如果disp属于[-128, 127]

; 不管JMP转移是哪一种，在编译中都在前面先加上 jmp short s 的机器码，后面用 nop 预留空位

; 
;	    对于				处理

; 	jmp short s 		正常编译 EB08	<-- 08 是不一定的，是位移				EB0B		总共占用了2字节空间

; 	jmp s 			编译成 EB09 后面用 NOP 指令，预留出 1 字节（二进制8位 十六进制2位）的空位	EB09 XX		总共占用了3字节空间

; 	jmp near ptr s		编译成 EB06 后面用 NOP 指令，预留出 1 字节（二进制8位 十六进制2位）的空位	EB06 XX		总共占用了3字节空间

; 	jmp far ptr s 		编译成 EB03 后面用 NOP 指令，预留出 3 字节（二进制24位 十六进制3位）的空位	EB03 XX : XXXX	总共占用了5字节空间
; 
; =================================================================
