; 83 - retf小实验[检测点10.1]
; =================================================================
; ret - 用栈中的数据 - 修改 IP - 实现近转移
; retf - 用栈中的数据 - 修改 CS：IP - 实现远转移
;
; cpu 在执行 ret 指令时，进行下面两步的操作
;	(IP) = ((ss)*16 + (sp))		--> pop ip
;	sp = sp + 2
;

; cpu 在执行retf指令时，进行下面4步操作
;	(IP) = ((ss)*16 + (sp))
;	(sp) = (sp) + 2			--> pop ii
;	(CS) = ((ss)*16 + (sp))
;	(sp) = (sp) + 2			--> pop cs
; ===============================================================

; 补全程序实现从内存1000:0000 处开始执行指令
; =================================================================;
assume cs:codesg, ss:stacksg
; =================================================================
stacksg segment
		db 16 dup (0)
stacksg ends
; =================================================================
codesg segment
start:		mov ax, stacksg
		mov ss, ax
		mov sp, 16

		mov ax, 1000H	;____________
		push ax

		mov ax, 0	;____________
		push ax
		
		retf

codesg ends
; =================================================================
end start

