; 60 - 汇编编译器(masm.exe)JMP指令的相关处理及问题【IV 向后转移】
; =================================================================
; 如果disp在区间 [-32768,32767]
; =================================================================

assume cs:codesg

codesg segment
begin:		;jmp short s	编译错误
		jmp s
		jmp near ptr s
		jmp far ptr s
		
		db 100 dup (0b8h,0,0)
	s:	mov ax, 0
codesg ends

end begin


; =================================================================
; 在Debug中执行并查看数据，详尽解释请见P332 附录3
; =================================================================
; 如果disp属于[-32768,32767]

; 不管JMP转移是哪一种（除了jmp short s），此时都不会用 nop 预留空位

; 
;	    对于				处理

; 	jmp short s 		产生编译错误

; 	jmp s、jmp near ptr s	编译成 E9 + 位移		E9 3401	
	
; 	jmp far ptr s 		编译成 EA + 段地址:偏移地址	EA 3701 6A07
; 
; =================================================================
