; 11 - 在代码段中安排自定义栈空间
; ======================================================
; 完成下面的程序利用栈将程序中定义的数据逆序存放
; ======================================================

assume cs:codesg

codesg segment

; --------------------------- 自定义数据部分 ---------------------------
		dw 0123H, 0456H, 0789H, 0ABCH, 0DEFH, 0FEDH, 0CBAH, 0987H		; 在代码段中自定义的数据，这里定义了 8个字型数据
																		; 在 “dw“ 中 	-->
																		; d - define	--> 定义
																		; w - word		--> 字型数据
		dw 0, 0, 0, 0, 0, 0, 0, 0 		; 定义了8个字型数据(dw)给栈

;==================================================
; 注意：如果在代码段中自定义的栈空间或者数据，这些自定义的数据会放在 CS:IP开始的地方,因为他们占用了IP寄存器的变化范围。
; 这么做并不妥当，后续会有相应的优化方案。 此处先这么用
;==================================================

; --------------------------- 设置了ds数据寄存器，SS:IP栈寄存器 ---------------------------
start:	mov ax, cs
		mov ds, ax

		mov ss, ax
		mov sp, 31 + 1 		; <=== 这里注意栈的设置，这里要+1，如果忘了去回顾栈的push机制及栈顶的设置

		mov bx, 0
		mov cx, 8

; --------------------------- 通过 loop 推入数据 ---------------------------
pushData:	push ds:[bx]
		add bx, 2
		loop pushData

		mov cx, 8
		mov bx, 0

; --------------------------- 通过 loop 弹出数据 ---------------------------
popData:	pop ds:[bx]
		add bx, 2
		loop popData

codesg ends

end start
