#include <iostream>

#if 0

§©§Ñ§Õ§Ñ§ß§Ú§ñ §á§à §ä§Ö§Þ§Ö §±§°§¥§±§²§°§¤§²§¡§®§®§½ :
1. ËãÊý×ó/ÓÒÒÆ - §¯§Ñ§á§Ú§ê§Ú§ä§Ö §æ§â§Ñ§Ô§Þ§Ö§ß§ä §á§â§à§Ô§â§Ñ§Þ§Þ§í §ß§Ñ §Ó§ã§ä§â§à§Ö§ß§ß§à§Þ §Ñ§ã§ã§Ö§Þ§Ò§Ý§Ö§â§Ö - §ã§Õ§Ó§Ú§Ô§Ñ §Ñ§â§Ú§æ§Þ§Ö§ä§Ú§é§Ö§ã§Ü§à§Ô§à §Ó§á§â§Ñ§Ó§à(§Ó§Ý§Ö§Ó§à).
2. Ñ­»·×ó/ÓÒÒÆ - §¯§Ñ§á§Ú§ê§Ú§ä§Ö §æ§â§Ñ§Ô§Þ§Ö§ß§ä §á§â§à§Ô§â§Ñ§Þ§Þ§í §ß§Ñ §Ó§ã§ä§â§à§Ö§ß§ß§à§Þ §Ñ§ã§ã§Ö§Þ§Ò§Ý§Ö§â§Ö.§³§Õ§Ó§Ú§Ô §è§Ú§Ü§Ý§Ú§é§Ö§ã§Ü§Ú§Û §Ó§á§â§Ñ§Ó§à(§Ó§Ý§Ö§Ó§à).
3. Âß¼­×ó/ÓÒÒÆ - §¯§Ñ§á§Ú§ê§Ú§ä§Ö §æ§â§Ñ§Ô§Þ§Ö§ß§ä §á§â§à§Ô§â§Ñ§Þ§Þ§í §ß§Ñ §Ó§ã§ä§â§à§Ö§ß§ß§à§Þ §Ñ§ã§ã§Ö§Þ§Ò§Ý§Ö§â§Ö.§³§Õ§Ó§Ú§Ô §Ý§à§Ô§Ú§é§Ö§ã§Ü§Ú§Û §Ó§á§â§Ñ§Ó§à(§Ó§Ý§Ö§Ó§à).
4. Ë«×ÖµÝÔö - §¯§Ñ§á§Ú§ê§Ú§ä§Ö §æ§â§Ñ§Ô§Þ§Ö§ß§ä §á§â§à§Ô§â§Ñ§Þ§Þ§í §ß§Ñ §Ñ§ã§ã§Ö§Þ§Ò§Ý§Ö§â§Ö - §Ú§ß§Ü§â§Ö§Þ§Ö§ß§ä §Õ§Ó§à§Û§ß§à§Ô§à §ã§Ý§à§Ó§Ñ.§³§â§Ñ§Ó§ß§Ú§ä§Ö §£§Ñ§ê §ã§á§à§ã§à§Ò §ã §ä§Ö§Þ, §Ü§Ñ§Ü §ï§ä§à §Õ§Ö§Ý§Ñ§Ö§ä §Ü§à§Þ§á§Ú§Ý§ñ§ä§à§â.
5. Ë«×ÖµÝ¼õ - §¯§Ñ§á§Ú§ê§Ú§ä§Ö §æ§â§Ñ§Ô§Þ§Ö§ß§ä §á§â§à§Ô§â§Ñ§Þ§Þ§í §ß§Ñ §Ñ§ã§ã§Ö§Þ§Ò§Ý§Ö§â§Ö - §Õ§Ö§Ü§â§Ö§Þ§Ö§ß§ä §Õ§Ó§à§Û§ß§à§Ô§à §ã§Ý§à§Ó§Ñ.§±§à§ã§Þ§à§ä§â§Ú§ä§Ö, §Ü§Ñ§Ü §ï§ä§à §Õ§Ö§Ý§Ñ§Ö§ä §Ü§à§Þ§á§Ú§Ý§ñ§ä§à§â.
6. ¸Ä±äË«×Ö·ûºÅ - §¯§Ñ§á§Ú§ê§Ú§ä§Ö §æ§â§Ñ§Ô§Þ§Ö§ß§ä §á§â§à§Ô§â§Ñ§Þ§Þ§í §ß§Ñ §Ñ§ã§ã§Ö§Þ§Ò§Ý§Ö§â§Ö - §ã§Þ§Ö§ß§Ñ §Ù§ß§Ñ§Ü§Ñ §Õ§Ó§à§Û§ß§à§Ô§à §ã§Ý§à§Ó§Ñ.
7. Ë«×Ö¼Ó·¨ - §¯§Ñ§á§Ú§ê§Ú§ä§Ö §æ§â§Ñ§Ô§Þ§Ö§ß§ä §á§â§à§Ô§â§Ñ§Þ§Þ§í §ß§Ñ §Ñ§ã§ã§Ö§Þ§Ò§Ý§Ö§â§Ö - §ã§Ý§à§Ø§Ö§ß§Ú§Ö §Õ§Ó§å§ç §Õ§Ó§à§Û§ß§í§ç §ã§Ý§à§Ó.
8. Ë«×Ö±È½Ï - §¯§Ñ§á§Ú§ê§Ú§ä§Ö §æ§â§Ñ§Ô§Þ§Ö§ß§ä §á§â§à§Ô§â§Ñ§Þ§Þ§í §ß§Ñ §Ñ§ã§ã§Ö§Þ§Ò§Ý§Ö§â§Ö - §ã§â§Ñ§Ó§ß§Ö§ß§Ú§Ö §Õ§Ó§å§ç §Õ§Ó§à§Û§ß§í§ç §ã§Ý§à§Ó.
9. Ë«×Ö³Ë·¨ - §¯§Ñ§á§Ú§ê§Ú§ä§Ö §æ§â§Ñ§Ô§Þ§Ö§ß§ä §á§â§à§Ô§â§Ñ§Þ§Þ§í §ß§Ñ §Ñ§ã§ã§Ö§Þ§Ò§Ý§Ö§â§Ö - §å§Þ§ß§à§Ø§Ö§ß§Ú§Ö §Õ§Ó§å§ç §Õ§Ó§à§Û§ß§í§ç §ã§Ý§à§Ó.

#endif



int main()
{

	return 0;
}