; 37 - div 16位除法
; =================================================================
; 除法操作：div

;	如果除数为16位
;	则被除数为32位，DX存放高16位，AX存放低16位		16÷3=5...1	（16-被除数，3-除数，5-商，1余数）

; 16位除法运算结果的存放
; 	AX - 储存 商
; 	DX - 储存 余数
; =================================================================

assume cs:codesg, ds:datasg

;------------------
datasg segment
				dw 3, 0, 0, 0, 0, 0, 0, 0
datasg ends
;------------------
codesg segment
start:			mov ax, datasg
				mov ds, ax

				;---------------------------------------------------------------------------------------
				;mov dx, 0012		; 注意！！！高16位和低16位并不是"十进制"下简单的拼接，而是运算之后的结果
				;mov ax, 3400		; 不如这里并不是简单拼接成 123400，在寄存器拼接后：是 000C 0D48 = 789832 （这并不是我们所想要的结果）
				;---------------------------------------------------------------------------------------

				mov dx, 0
				mov ax, 16

				div word ptr ds:[0]

codesg ends
end start
