; 102 - 利用mul乘法探讨参数的传递
; =================================================================
; 
; mul 乘法指令
; 		
; 8位乘法：
; 		一个默认在AL中，另一个可以是8位reg或者内存单元 byte ptr ds:[??]	--> 结果在AX中
; 
; 16位乘法：
; 		一个默认在AX中，另一个可以是16位reg或者内存单元 word ptr ds:[??] --> 结果：低位在AX中，高位在DX中
; 
; 
; =================================================================
; 编程：计算data段中第一组数据的3次方，结果存放在后面一组dword单元中
; =================================================================

assume cs:codesg, ds:datasg

; =================================================================

datasg segment
		dw 1,2,3,4,5,6,7,8
		dd 0,0,0,0,0,0,0,0
datasg ends

; =================================================================


codesg segment
start:		call set_reg
		
		mov cx, 8

loop_cude:	mov bx, ds:[di]
		call cube
		mov es:[si + 0], ax
		mov es:[si + 2], dx
		add si, 4
		add di, 2
		loop loop_cude

		mov ax, 4c00h
		int 21h


	; --------------------------- set_reg -------------------------
	; ds:di --> 数据从哪里来
	; es:si --> 数据到哪里去
	set_reg:	mov ax, datasg
			mov ds, ax
			mov es, ax
			mov di, 0
			mov si, 16
			ret


	; --------------------------- 子程序 ---------------------------
	; 说明：计算N的3次方
	; 参数：(bx) = N
	; 结果：(ds:ax) = N^3
	cube: 	mov ax, bx
		mul bx
		mul bx
		ret

codesg ends
end start

; =================================================================;



