; 70 - LOOP循环指令【检测点9.3】
; =================================================================
;
; Loop 指令为循环指令，所有的循环指令都是短转移，在对应的机器码中包含转移的位移，而不是地址。
; 对CS:IP的修改范围为 -128 ~ 127
;
; LOOP指令格式：loop 标号 (cx) = (cx)-1, 如果(cx) != 0,转移到标号处运行
;
; 操作：
;	1. cx = cx - 1
;	2. 如果 cx != 0, ip = ip + 8位位移
;
;
; =================================================================
; 要求：补全程序中，利用loop指令，实现在内存2000H段中查找第一个值为0的字节，找到后将他的偏移地址储存在dx中 (P185)
; =================================================================

assume cs:codesg

codesg segment
start:		mov ax, 2000H
		mov ds, ax
		mov bx, 0

	s:	mov cl ,[bx]
		mov ch, 0

		inc cx		;____________ 注意：不能用 mov cx, [bx] + 1  --> 会被编译成 [bx + 1] ！！！

		inc bx
		loop s

	ok:	dec bx		; dec指令和inc相反。dec bx进行的操作为 bx--
		mov dx, bx
		mov ax, 4c00h
		int 21h
codesg ends

end start

; 
; =================================================================
