; 10 - 在代码段中安排自定义数据
; ======================================================
; 计算下面8个字型数据 将结果保存在 ax 寄存器中
; 1, 2, 3, 4, 5, 6, 7, 8
; ======================================================

assume cs:codesg

codesg segment

; --------------------------- 自定义数据部分 ---------------------------
		dw 1, 2, 3, 4, 5, 6, 7, 8		; 在代码段中自定义的数据，这里定义了 8个字型数据
										; 在 “dw“ 中 	-->
										; d - define	--> 定义
										; w - word		--> 字型数据

;==================================================
; 注意：如果在代码段中自定义的栈空间或者数据，这些自定义的数据会放在 CS:IP开始的地方,因为他们占用了IP寄存器的变化范围。
; 这么做并不妥当，后续会有相应的优化方案。 此处先这么用
;==================================================


start:	; mov ax, cs 【错误】
		; mov ip, 16 	<--- 如果代码段中定义了 dw，IP会自动的跳过 dw 段（在此处 也就是自动 + 10H），所以不需要手动设定。所以这行是多余的

		mov ax, 0
		mov bx, 0
		mov cx, 8

loopAdd:	add ax, cs:[bx]
		add bx, 2
		loop loopAdd

codesg ends

end start
