; 39 - 利用除法指令计算 100001÷100
; =================================================================
; 除法操作：div

; 分析：
;	100001÷100
;		100001 - 被除数，大于2^8(65536) 不可以单独存放在AX寄存器中，所以要存放在2个寄存器中，被除数为32位
;		100001D = 1 86A1
;		==> 这是一个16位的除法
;			==> 低16位 - AX - 86A1
;			==> 高16位 - DX - 1

;	记忆技巧：	A在字母表中的排位比较超低，所以AX存放低位数据
;				D在字母表中排位比A高，所以DX存放高位数据
;
;
; 结果：
;	商 - AL
;	余数 - AH
; =================================================================

assume cs:codesg

codesg segment
start:			MOV AX, 86A1H		; 注意：别忘了加'H'
				MOV DX, 0001H

				MOV BX, 100
				DIV BX
codesg ends
end start