; 64 - 转移指令在内存中的jmp指令【检测点9.1】 
; =================================================================
; 要求：若要使用程序中的jmp指令执行后，CS:IP指向程序的第一条指令，在data段中应该定义那些数据？
; =================================================================
; 转移指令在内存中的jmp指令有两种格式

; 1. jmp word ptr 内存单元地址（段内转移）	--> 从内存单元地址处开始存放着一个字，是转移的目的《偏移地址》，内存单元地址可用寻址方式的任一格式输出

; 2. jmp dword ptr 内存单元地址（段间转移）	--> 从内存单元地址处开始存放两个字，高地址处的字是转移的目的段地址，低地址处是转移的目的偏移地址
		; (CS) = (内存单元地址 + 2)
		; (IP) = (内存单元地址)

; =================================================================

assume cs:codesg, ds:datasg

datasg segment
		; ? 在下面填写代码
		db 0, 0, 0	; <--
datasg ends

codesg segment
start:		mov ax, datasg
		mov ds, ax	

		mov bx, 0
		jmp word ptr [bx + 1]

codesg ends

end start

; 
; =================================================================
