; 15 - 将数据、代码、栈放入不同段【对任务11的优化】
; =================================================================
; 完成下面的程序利用栈将程序中定义的数据逆序存放
; =================================================================

assume cs:codesg, ds:datasg, ss:stacksg 	; <--- 别忘了这个

;-------------------------数据段-------------------------
datasg segment
		dw 0123H, 0456H, 0789H, 0ABCH, 0DEFH, 0FEDH, 0CBAH, 0987H
datasg ends
;-------------------------------------------------------


;-------------------------栈段-------------------------
stacksg segment stack
		dw 0, 0, 0, 0, 0, 0, 0, 0 		; 定义了8个字型数据(dw)给栈
stacksg ends
;-------------------------------------------------------


;-------------------------代码段-------------------------
codesg segment
		
start:	mov ax, datasg		; <--- 虽然定义了，但是还需要重新指定。 因为CPU并不能判定你定义的是啥玩意
		mov ds, ax			; <--- 只有当这条语句执行过后，程序才能将自定义的内容(第10行)写入到内存段中

		mov ax, stacksg		; <--- 指定栈段，注意！！栈需求是多大就设置多大（第30行）！！！！否则其他指令可能给压没喽
		mov ss, ax
		mov sp, 16 		; <=== 这里注意栈的设置，这里要+1，如果忘了去回顾栈的push机制及栈顶的设置

		mov bx, 0
		mov cx, 8

pushData:	push ds:[bx]
			add bx, 2
			loop pushData

		mov bx, 0
		mov cx, 8

popData:	pop ds:[bx]
			add bx, 2
			loop popData

codesg ends

end start
