; 40 - div运算dd伪指令下的数据	2020年7月23日15:08:00
; =================================================================
; 						【问题8.1】 汇编语言4th - P171
; 用div计算dta段中第一个数据除以第二个数据后的结果，商存放在第三个数据的存储单元中
; =================================================================

; 除法操作：div
; 伪指令 dd：double word，双字 - 占用 - 32位 - 4Byte - 2字
; 分析：
;	data段中第一个数据是被除数，为dword（双字）型，32位所以在做除法之前，
;	用dx（高位）和ax（低位）存储、
;	应将data:0 字单元存放在ax（低位）寄存器中【！！！！！！！不是dx！！！！！！】
;	data:2 字单元存放dx寄存器中【！！！！】
;		====>>> 16位除法

;	记忆技巧：	A在字母表中的排位比较超低，所以AX存放低位数据
;				D在字母表中排位比A高，所以DX存放高位数据
;				商会先运算出来，所以存放在AX中 - 或者说数学中商在前，余数在后
;				余数后运算出来，所以存放在DX中
;
; 结果：
;	商 - AX
;	余数 - DX
; =================================================================

assume cs:codesg, ds:datasg

datasg segment
				dd 100001			; 首先要在debug中查看内存的排列
				dw 100
				dw 0
datasg ends

codesg segment
start:			mov ax, datasg
				mov ds, ax

				mov AX, ds:[0]		; 进行存储
				mov DX, ds:[2]

				div word ptr ds:[4]	; 运算

				mov ds:[6], AX 		; 移动结果
				
codesg ends
end start