; 13 - 利用栈将已给数据覆盖程序中的另一数据【检测点6.1】
; =================================================================
; 下面的程序实现依次利用内存 0:0 ~ 0:15 单元中的内容改写程序dw中的数据，数据的传递用栈来进行，栈空间设置在程序内，完成程序
; =================================================================

assume cs:codesg

codesg segment

		dw 0123H, 0456H, 0789H, 0ABCH, 0DEFH, 0FEDH, 0CBAH, 0987H <<=== 改写它
		dw 0, 0, 0, 0, 0, 0, 0, 0
;==================================================
; 注意：自定义的栈空间或者数据，这些自定义的数据会放在 CS:IP前面
;==================================================


start:	mov ax, cs ;_________
		mov ss, ax
		mov sp, 31 + 1 ;_________

		mov ax, 0
		mov ds, ax
		mov bx, 0

		mov cx, 8

s:		push ds:[bx]
		pop cs:[bx] ;_________
		add bx, 2
		loop s

codesg ends

end start
