; 150 - 使用 rep movsb、cld实现数据正向传送
; =================================================================

; 编程，用串传送指令，将data段中的第一个字符串复制到塔后面的空间中

; =================================================================
; 
; cld --> 将 CF 设置为 0 --> 正向传送
; std --> 将 CF 设置为 1 --> 逆序传送
; 
; 当我们使用串传送指令进行数据传送的时候，需要给它提供一些必要的信息，他们是：
; 1. 传送的起始位置：ds:si
; 2. 传送的目的为止：es:di
; 3. 传送的长度：cx
; 4. 传送的方向：DF
; =================================================================
assume cs:code, ss:stack, ds:data
; =================================================================
data segment
	db 'Welcome to masm!'
	db 16 dup (0)
data ends
; =================================================================
stack segment stack
		db	128 dup (0)
stack ends
; =================================================================
code segment
start:		mov ax, stack
		mov ss, ax
		mov sp, 128

		mov ax, data
		mov ds, ax
		mov si, 0
		mov es, ax
		mov di, 16
		
		mov cx, 16
		cld		; 将DF设置为0，正向传送	
		rep movsb

		mov ax, 4c00h
		int 21h
	
code ends

end start
