; 86 - 根据位移进行转移的CALL指令
; =================================================================
; call 标号	==》 将“当前”的IP压栈后，转移到标号处执行指令
;
; CPU执行 “CALL 标号”时相当于进行
; PUSH IP
; JMP NEAR PTR 标号
; ===============================================================

; 以下程序执行后，AX中的值为多少
; =================================================================;
assume cs:codesg, ss:stacksg
; =================================================================
stacksg segment
		db 16 dup (0)
stacksg ends
; =================================================================
codesg segment
start:		mov ax, 0
		call s
		inc ax	; <=== 在CALL执行前，IP指向这里
	s:	pop ax	; AX == 6
codesg ends
; =================================================================
end start

