; 91 - call和ret的配合使用
; =================================================================
; 转移地址在 “内存” 中的call指令有两种		==》 在内存中其实就是在ds段中



; 1. call word ptr 内存单元地址
; 	push ip
;	jmp word ptr 内存单元地址



; 2. call dword ptr 内存单元地址
; 	push CS
; 	push ip
;	jmp dword ptr 内存单元地址

; ===============================================================
; 程序返回前，bx中的值是多少
; ===============================================================

assume cs:codesg

; =================================================================

codesg segment
start:		mov ax, 1	; ax == 1
		mov cx, 3	; cx == 3
		call s				; 《《====== 注意这里是call s，是段内短转移，所以只push ip	
		mov bx, ax	; bx == 8
		mov ax, 4c00h
		int 21h
	s:	add ax, ax
		loop s		; loop: 1. cx = cx - 1	2.判断cx中的值是否为0
		ret
codesg ends
; =================================================================
end start

