; 145 - 统计某内存段中，大小在[32,128]的数据个数
; =================================================================

; 补全下面程序，统计F000:0处32个字节中，大小在[32,128]的数据个数

; =================================================================

; cmp 通过减法影响标志寄存器，然后再用相应的判断指令即可完成通过条件跳转
; 
; 具体为什么此处不做说明，详见 P225
; 
; je = 
; jne !=
; jb <
; jnb >=
; ja >
; jna <=
; 
; =================================================================
assume cs:code, ss:stack
; =================================================================

; =================================================================
stack segment stack
		db	128 dup (0)
stack ends
; =================================================================
code segment
start:		mov ax, stack
		mov ss, ax
		mov sp, 128

		mov ax, 0770H	; 因为 F000处的内存无法修改，所以改成这个
		mov ds, ax

		mov bx, 0
		mov dx, 0	; count
		mov cx, 32	; 32 times

	s:	mov al, ds:[bx]
		cmp al, 32
		jb s0			;__________
		cmp al, 128
		ja s0			;__________
		inc dx
	s0:	inc bx
		loop s


		mov ax, 4c00h
		int 21h
	
code ends

end start
