; 140 - 借助cmp判断跳转
; =================================================================
; cmp 通过减法影响标志寄存器，然后再用相应的判断指令即可完成通过条件跳转
; 
; 具体为什么此处不做说明，详见 P225
; 
; je = 
; jne !=
; jb <
; jnb >=
; ja >
; jna <=
; 

; =================================================================
; 编程：实现以下功能：
; 如果 (ah)=(bh) 则 (ah)=(ah)+(ah)，否则(ah)=(ah)+(bh)
; =================================================================
assume cs:code, ss:stack
; =================================================================
stack segment stack
		db	128 dup (0)
stack ends
; =================================================================
code segment
start:		mov ax, stack
		mov ss, ax
		mov sp, 128
		

		mov ah, 3
		mov bh, 4

		cmp ah, bh
		je s
		add ah, bh
		jmp ok
	s:	add ah, ah

	ok:	mov ax, 4c00h
		int 21h
		
	
code ends

end start
