; 66 - jcxz有条件转移指令【检测点9.2】
; =================================================================

; jcxz 指令为有条件转移指令，所有的有条件转移指令都是短转移，在对应的机器码中包含转移的位移，而不是目的地之。
; 对IP的修改范围都是：-128~127

; jcxz --> j - jump
;	   c - cx
;	   z - zero 0



; jczx 指令格式：
	; jczx 标号 --> 如果cx等于0，则到标号处执行

; 操作：当(cx) = 0时，(IP) = (IP) + 8位位移
	
; 	8位位移 = 标号处地址 - jczx指令后的下一个指令
;	-128~127，用补码表示	

; =================================================================
; 要求：补全程序中，利用jczx指令，实现在内存2000H段中查找第一个值为0的字节，找到后将他的偏移地址储存在dx中 (P184)
; =================================================================

assume cs:codesg

codesg segment
start:		mov ax, 2000H
		mov ds, ax
		mov bx, 0

	s:	mov ch, 0		;_________
		mov cl, ds:[bx]		;_________
		jcxz ok			;_________
		inc bx			;_________
		jmp short s

	ok:	mov dx, bx
		
		mov ax, 4c00h
		int 21h
codesg ends

end start

; 
; =================================================================
