; 87 - 转移的目的地址在指令中的CALL指令
; =================================================================
; call far ptr 标号	==》 将“当前”的cs:IP压栈后，转移到标号处执行指令
;
; CPU执行 “CALL far ptr 标号”时相当于进行
; PUSH cs
; PUSH ip
; JMP far PTR 标号
; ===============================================================

; 以下程序执行后，AX中的值为多少
; =================================================================;
assume cs:codesg
; =================================================================
codesg segment
start:		mov ax, 0	; ax == 0
		call far ptr s	; CS == 1000, IP == 8
		inc ax		; <<=== IP == 8

	s:	pop ax
		add ax, ax
		pop bx
		add ax, bx
		

		mov ax, 4c00h
		int 21h
codesg ends
; =================================================================
end start

