; 151 - 使用 rep movsb、std实现数据逆向传送
; =================================================================

; 编程，用串传送指令，将F000H段中的最后16个字符复制到data段中

; =================================================================
; 
; cld --> 将 CF 设置为 0 --> 正向传送
; std --> 将 CF 设置为 1 --> 逆序传送
; 
; 当我们使用串传送指令进行数据传送的时候，需要给它提供一些必要的信息，他们是：
; 1. 传送的起始位置：ds:si
; 2. 传送的目的为止：es:di
; 3. 传送的长度：cx
; 4. 传送的方向：DF
; =================================================================
assume cs:code, ss:stack, ds:data
; =================================================================
data segment
	db 16 dup (0)
data ends
; =================================================================
stack segment stack
		db	128 dup (0)
stack ends
; =================================================================
code segment
start:		mov ax, stack
		mov ss, ax
		mov sp, 128

		mov ax, 0F000H
		mov ds, ax
		mov si, 0FFFFH

		mov ax, data
		mov es, ax
		mov di, 15
		
		mov cx, 16
		std		; 将DF设置为0，正向传送	
		rep movsb

		mov ax, 4c00h
		int 21h
	
code ends

end start
