; 46 - 寻址方式在结构化数据访问中的应用 - 实验7
; =================================================================

assume cs:codesg
; ----------------------------------------------------------------
datasg segment
		db	'1975','1976','1977','1978','1979','1980','1981','1982','1983'
		db	'1984','1985','1986','1987','1988','1989','1990','1991','1992'
		db	'1993','1994','1995'
		;以上是表示21年的21个字符串 year


		dd	16,22,382,1356,2390,8000,16000,24486,50065,97479,140417,197514
		dd	345980,590827,803530,1183000,1843000,2759000,3753000,4649000,5937000
		;以上是表示21年公司总收入的21个dword数据	sum

		dw	3,7,9,13,28,38,130,220,476,778,1001,1442,2258,2793,4037,5635,8226
		dw	11542,14430,15257,17800
		; 以上是表示21年公司雇员总人数的21个word型数据
datasg ends

; ----------------------------------------------------------------

table segment
		db 21 dup ('year summ ne ?? ')
table ends

; ----------------------------------------------------------------

codesg segment
		; 用ds表示数据从哪来
start:		mov ax, datasg
		mov ds, ax

		; 用es表示数据到哪里去
		mov ax, table
		mov es, ax


		; 设置寄存器
		mov bx, 0
		mov cx, 21
		mov si, 82
		mov bp, 0 
		
		; 将年份先移动到对应位置
loopLab:	mov ax, ds:[bx]
		mov es:[bp], ax

		add bx, 2
		add bp, 2

		mov ax, ds:[bx]
		mov es:[bp], ax
		; ---------------------

		; 将dd双字型的收入数据移动到相关位置
		mov ax, ds:[bx + si]
		mov es:[bp + 3], ax


		mov ax, ds:[bx + si + 2]
		mov es:[bp + 3 + 2], ax
		; -------------------------------

		; 将dw字型数据的公司雇员数据移动到相关寄存器
		mov ax, ds:[bx + si + 84]
		mov ES:[bp + 8], ax

		; -----------------------------------------

		; 进行16位除法运算，并将结果放入到相应位置
		mov ax, ds:[bx + si]
		mov dx, ds:[bx + si + 2]

		div word ptr ds:[bx + si + 84]

		mov es:[bp +11], ax
		
		; ------------------------------------------

		add bx, 2
		add bp, 14

		loop loopLab

		mov ax, 4c00h
		int 21H
		
codesg ends

end start

