; 12 - 通过已给数据和代码覆盖程序中的数据【检测点6.1】
; =================================================================
; 下面的程序实现依次利用内存 0:0 ~ 0:15 单元中的内容改写程序dw中的数据，完成程序
; =================================================================

assume cs:codesg

codesg segment

		dw 0123H, 0456H, 0789H, 0ABCH, 0DEFH, 0FEDH, 0CBAH, 0987H												
;==================================================
; 注意：自定义的栈空间或者数据，这些自定义的数据会放在 CS:IP开始的地方
;==================================================


start:	mov ax, 0
		mov ds, ax
		mov bx, 0

		mov cx, 8

s:		mov ax, ds:[bx]
		；-------------------------------------
		mov cs:[bx], ax		; <-- 此处填入代码
		；-------------------------------------
		add bx, 2
		loop s

		;mov ax, 4COOH
		;int 21H

codesg ends

end start
