; 61 - JMP跳转指令 - 分析一个奇怪的程序【实验8】
; =================================================================

; =================================================================
; 此实验对于理解和检测掌握JMP指令的原理非常重要，请认真对待
; 此实验的重点在于，转移指令在机器中的存放是以机器码存放的，该跳转多少在机器码中确定，特别是在复制的时候不是简单地是汇编指令复制，而是机器码的复制
; 重点2：回忆指令执行的过程
		; 从CS：IP指向的内存单元读取指令，读取的指令放入到指令缓存器中
		; （IP）= (IP) + 所读取指令的长度。从而指向下一条指令
		; 执行指令。转到步骤1. 重复这个过程
; =================================================================

; 分析下面的程序，在运行前思考：这个程序能正常的返回吗

; =================================================================
; 在Debug中执行并查看数据，详尽解释请见P332 附录3
; =================================================================

assume cs:codesg

codesg segment
		mov ax, 4c00h	; <==== 最后跳转到这里，所以可以正常退出
		int 21h

start:		mov ax, 0		; 
	s:	jmp short s1		; 向上跳转 10 字节
		; nop			; 
		; nop

		mov di, offset s	; di-s
		mov si, offset s2	; di-s1
		mov ax, cs:[si]		; 
		mov cs:[di], ax		; cs:[s] <-- cs:[s2]

	s0:	jmp short s

	s1:	mov ax, 0		; 
		int 21h			
		mov ax, 0

	s2:	jmp short s1		; 下一个nop处的指令地址 - s1处的指令地址 = 10
		nop		;
	
codesg ends
end start
; 
; =================================================================
