; 58 - 汇编编译器(masm.exe)JMP指令的相关处理及问题【II 向前转移】
; =================================================================
; 在Debug中执行并查看数据
; =================================================================

assume cs:codesg

codesg segment
	s:	db 100 dup (0b8h,0,0)
		jmp s
	;	jmp short s
		jmp near ptr s
		jmp far ptr s
codesg ends

end s


; =================================================================
; 如果disp属于[-32768, 372867]
; 
; 	jmp short s 		将产生编译错误

; 	jmp s 或 jmp near ptr s	产生 jmp near ptr s 的机器码，机器码格式为【E9????】 		占用3个字节

; 	jmp far ptr s 		将产生相应的编码，对应的机器码格式为：【EA 偏移地址 段地址】	占用5个字节
; 
; =================================================================
