; 186 - 在屏幕dh行、dl列显示以美元符结尾的字符串【中断例程】
; =================================================================

; 186 - 在屏幕5行、12列显示以美元符'$'结尾的字符串【中断例程】
; 程序说明请详见 P260
; 

; =================================================================
assume cs:code, ss:stack
; =================================================================
data segment
		db 'Welcome to masm!', '$'	; 字符串要以 $ 结尾!!!!!
data ends
; =================================================================
stack segment stack
		db	128 dup (0)
stack ends
; =================================================================
code segment
start:		mov ax, stack
		mov ss, ax
		mov sp, 128

		mov ah, 2	; 调用第 2 个子例程 - 定位光标
		mov bh, 0	; 第 0 页
		mov dh, 5	; 行
		mov dl, 12	; 列
		int 10h	; <-- 10H

		mov ax, data
		mov ds, ax
		mov dx, 0	; ds:dx 指向字符串的首地址data:0
		mov ah, 9	; 调用第 9 个子例程 - 在光标位置显示字符串，字符串要以 $ 结尾
		int 21h	; <-- 21H


		mov ax, 4c00h
		int 21h

code ends

end start
